# Задание 1. Напишите тесты, покрывающие на 100% метод evenOddNumber, который проверяет, является ли
# переданное число четным или нечетным:

def even_odd_number(n: int) -> bool:
    return n % 2 == 0


# if __name__ == '__main__':
#     print(even_odd_number(5))
